In [4]:
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")

Opened Database Sucessfully

In [6]:
conn.execute('''CREATE TABLE CLASS
(ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);''')

print("Table Created Sucessfully")

Table Created Sucessfully

In [5]:
conn

In [10]:
conn.execute("INSERT INTO CLASS (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (1,'Nilesh','22','Mumbai',200000.00)");

conn.execute("INSERT INTO CLASS (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (2,'Abhishek','21','Pune',300000.00)");

conn.execute("INSERT INTO CLASS (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (3,'Spanden','20','New Delhi',400000.00)");

conn.execute("INSERT INTO CLASS (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (4,'Vijay','23','Chennai',500000.00)");

conn.commit()
print("Records Created Sucessfully")
conn.close()

IntegrityError: UNIQUE constraint failed: CLASS.ID

In [12]:
conn.close()

In [24]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")

Opened Database Sucessfully

In [21]:
cursor=conn.execute("SELECT ID,NAME,ADDRESS,SALARY from CLASS")
for row in cursor:
    print("ID=", row[0])
    print("NAME=", row[1])
    print("ADDRESS=", row[2])
    print("SALARY=", row[3]), "\n"

print("SELECT Query Sucessfully")
conn.close()

ID= 1
NAME= Nilesh
ADDRESS= Mumbai
SALARY= 200000.0
ID= 2
NAME= Abhishek
ADDRESS= Pune
SALARY= 300000.0
ID= 3
NAME= Spanden
ADDRESS= New Delhi
SALARY= 400000.0
ID= 4
NAME= Vijay
ADDRESS= Chennai
SALARY= 500000.0
SELECT Query Sucessfully

In [26]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")

conn.execute("UPDATE CLASS set SALARY = 300000 where ID = 1")
conn.commit
print("Total Number of rows updated : ", conn.total_changes)

cursor = conn.execute("SELECT ID, NAME, ADDRESS,SALARY from CLASS")
for row in cursor:
    print("ID = ", row[0])
    print("Name = ",row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3]), "\n"
    
print("Update Query Sucessfully")
conn.close()

Opened Database Sucessfully
Total Number of rows updated :  1
ID =  1
Name =  Nilesh
ADDRESS =  Mumbai
SALARY =  300000.0
ID =  2
Name =  Abhishek
ADDRESS =  Pune
SALARY =  300000.0
ID =  3
Name =  Spanden
ADDRESS =  New Delhi
SALARY =  400000.0
ID =  4
Name =  Vijay
ADDRESS =  Chennai
SALARY =  500000.0
Update Query Sucessfully

In [27]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")

conn.execute("DELETE from CLASS where ID = 2;")
conn.commit()
print("Total Number of rows deleted: ", conn.total_changes)
cursor = conn.execute("SELECT ID,NAME,ADDRESS,SALARY from CLASS")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ",row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3]), "\n"

    
print("Delete Resord Sucessfully")
conn.close()

Opened Database Sucessfully
Total Number of rows deleted:  1
ID =  1
NAME =  Nilesh
ADDRESS =  Mumbai
SALARY =  200000.0
ID =  3
NAME =  Spanden
ADDRESS =  New Delhi
SALARY =  400000.0
ID =  4
NAME =  Vijay
ADDRESS =  Chennai
SALARY =  500000.0
Delete Resord Sucessfully

In [28]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")

conn.execute("DELETE from CLASS where ID = 1;")
conn.commit()
print("Total Number of rows deleted: ", conn.total_changes)
cursor = conn.execute("SELECT ID,NAME,ADDRESS,SALARY from CLASS")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ",row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3]), "\n"

    
print("Delete Resord Sucessfully")

Opened Database Sucessfully
Total Number of rows deleted:  1
ID =  3
NAME =  Spanden
ADDRESS =  New Delhi
SALARY =  400000.0
ID =  4
NAME =  Vijay
ADDRESS =  Chennai
SALARY =  500000.0
Delete Resord Sucessfully

In [29]:
c = conn.cursor()

In [30]:
c

In [37]:
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ",row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3]), "\n"

In [38]:
conn.execute('''CREATE TABLE CLASS1
(ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);''')

print("Table Created Sucessfully")

Table Created Sucessfully

In [39]:
conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (25,'Nilesh','22','Mumbai',200000.00)");

conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (23,'Abhishek','21','Pune',300000.00)");

conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (35,'Spanden','20','New Delhi',400000.00)");

conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (44,'Vijay','23','Chennai',500000.00)");

conn.commit()
print("Records Created Sucessfully")
conn.close()

Records Created Sucessfully

In [41]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")
cursor=conn.execute("SELECT ID,NAME,ADDRESS,SALARY from CLASS1")
for row in cursor:
    print("ID=", row[0])
    print("NAME=", row[1])
    print("ADDRESS=", row[2])
    print("SALARY=", row[3]), "\n"

print("SELECT Query Sucessfully")
conn.close()

Opened Database Sucessfully
ID= 25
NAME= Nilesh
ADDRESS= Mumbai
SALARY= 200000.0
ID= 23
NAME= Abhishek
ADDRESS= Pune
SALARY= 300000.0
ID= 35
NAME= Spanden
ADDRESS= New Delhi
SALARY= 400000.0
ID= 44
NAME= Vijay
ADDRESS= Chennai
SALARY= 500000.0
SELECT Query Sucessfully

In [42]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")
cursor=conn.execute("SELECT ID,NAME,ADDRESS,SALARY from CLASS1 ORDER BY ID ASC")
for row in cursor:
    print("ID=", row[0])
    print("NAME=", row[1])
    print("ADDRESS=", row[2])
    print("SALARY=", row[3]), "\n"

print("SELECT Query Sucessfully")
conn.close()

Opened Database Sucessfully
ID= 23
NAME= Abhishek
ADDRESS= Pune
SALARY= 300000.0
ID= 25
NAME= Nilesh
ADDRESS= Mumbai
SALARY= 200000.0
ID= 35
NAME= Spanden
ADDRESS= New Delhi
SALARY= 400000.0
ID= 44
NAME= Vijay
ADDRESS= Chennai
SALARY= 500000.0
SELECT Query Sucessfully

In [43]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")
cursor=conn.execute("SELECT ID,NAME,ADDRESS,SALARY from CLASS1 ORDER BY ID DESC")
for row in cursor:
    print("ID=", row[0])
    print("NAME=", row[1])
    print("ADDRESS=", row[2])
    print("SALARY=", row[3]), "\n"

print("SELECT Query Sucessfully")
conn.close()

Opened Database Sucessfully
ID= 44
NAME= Vijay
ADDRESS= Chennai
SALARY= 500000.0
ID= 35
NAME= Spanden
ADDRESS= New Delhi
SALARY= 400000.0
ID= 25
NAME= Nilesh
ADDRESS= Mumbai
SALARY= 200000.0
ID= 23
NAME= Abhishek
ADDRESS= Pune
SALARY= 300000.0
SELECT Query Sucessfully

In [46]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")
cursor=conn.execute("SELECT ID,NAME,ADDRESS,SALARY from CLASS1 LIMIT 2")
for row in cursor:
    print("ID=", row[0])
    print("NAME=", row[1])
    print("ADDRESS=", row[2])
    print("SALARY=", row[3]), "\n"

print("SELECT Query Sucessfully")
conn.close()

Opened Database Sucessfully

OperationalError: no such table: CLASS1

In [47]:
conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")
cursor=conn.execute("DROP TABLE CLASS1")
print("Drop Query Sucessfully")
conn.close()

Opened Database Sucessfully

OperationalError: near "CLASS1": syntax error